Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# SetUserVariableTrigger.Title
source: Set User Variable…
de: Benutzervariable setzen…
ja: ユーザー変数を設定…
pt_br: Definir variável de usuário…
ru: Задать пользовательскую переменную…
zh_hans: 设置用户变量…

# SetUserVariableTrigger.ValuePlaceholder
source: Value for variable
de: Wert für Variable
ja: 変数の値
pt_br: Valor da variável
ru: Значение переменной
zh_hans: 变量的值

# ShellIntegration.AboutBody
source: To use shell integration features such as Command History, Recent Directories, Select Output of Last Command, and Automatic Profile Switching, your shell must be properly configured.
de: Um Shell-Integrationsfunktionen wie Befehlsverlauf, Letzte Verzeichnisse, Ausgabe des letzten Befehls auswählen und Automatischer Profilwechsel zu nutzen, muss Ihre Shell richtig konfiguriert sein.
ja: コマンド履歴、最近使用したディレクトリ、直前のコマンドの出力を選択、自動プロファイル切り替えなどのShell Integration機能を使用するには、シェルが正しく設定されている必要があります。
pt_br: Para usar recursos do Shell Integration, como Histórico de comandos, Diretórios recentes, Selecionar a saída do último comando e Troca automática de perfil, seu shell precisa estar configurado corretamente.
ru: Чтобы использовать функции интеграции с оболочкой, такие как история команд, недавние папки, выбор вывода последней команды и автоматическое переключение профилей, ваша оболочка должна быть правильно настроена.
zh_hans: 要使用 Shell 集成功能（如命令历史、最近的目录、选择最后一条命令的输出以及自动配置文件切换），你的 shell 必须正确配置。

# ShellIntegration.AboutTitle
source: About Shell Integration
de: Über Shell-Integration
ja: Shell Integrationについて
pt_br: Sobre o Shell Integration
ru: Об интеграции с оболочкой
zh_hans: 关于 Shell 集成

# ShellIntegration.InstallNow
source: Install Now
de: Jetzt installieren
ja: 今すぐインストール
pt_br: Instalar agora
ru: Установить сейчас
zh_hans: 立即安装

# ShellIntegration.LearnMore
source: Learn More…
de: Weitere Informationen…
ja: 詳細…
pt_br: Saiba mais…
ru: Подробнее…
zh_hans: 了解更多…

# ShellIntegrationInstaller.ContinueToDiscover
source: ➡ Select “Continue” to discover.
de: ➡ Wählen Sie „Fortfahren“, um die Shell zu ermitteln.
ja: ➡「続ける」を選択して検出します。
pt_br: ➡ Selecione “Continuar” para descobrir.
ru: ➡ Нажмите «Продолжить», чтобы определить оболочку.

# ShellIntegrationInstaller.ContinueToInstall
source: ➡ Select “Continue” to install iTerm2 utility scripts.
de: ➡ Wählen Sie „Fortfahren“, um die iTerm2-Hilfsskripte zu installieren.
ja: ➡「続ける」を選択してiTerm2のユーティリティスクリプトをインストールします。
pt_br: ➡ Selecione “Continuar” para instalar os scripts utilitários do iTerm2.
ru: ➡ Нажмите «Продолжить», чтобы установить служебные скрипты iTerm2.

# ShellIntegrationInstaller.ContinueToUpdate
source: ➡ Select “Continue” to update your shell’s dotfile.
de: ➡ Wählen Sie „Fortfahren“, um die Dotfile Ihrer Shell zu aktualisieren.
ja: ➡「続ける」を選択してシェルのdotfileを更新します。
pt_br: ➡ Selecione “Continuar” para atualizar o dotfile do seu shell.
ru: ➡ Нажмите «Продолжить», чтобы обновить файл настроек вашей оболочки.

# ShellIntegrationInstaller.ContinueToWrite
source: ➡ Select “Continue” to write the shell integration script.
de: ➡ Wählen Sie „Fortfahren“, um das Shell-Integrationsskript zu schreiben.
ja: ➡「続ける」を選択してShell Integrationスクリプトを書き込みます。
pt_br: ➡ Selecione “Continuar” para gravar o script de integração com o shell.
ru: ➡ Нажмите «Продолжить», чтобы записать скрипт интеграции с оболочкой.

# ShellIntegrationInstaller.Discovered
source: ✅ Discovered your shell: you use “%@”.
de: ✅ Ihre Shell wurde ermittelt: Sie verwenden „%@“.
ja: ✅ シェルを検出しました: 「%@」を使用しています。
pt_br: ✅ Shell descoberto: você usa “%@”.
ru: ✅ Оболочка определена: вы используете «%@».
zh_hans: ✅ 已发现您的 shell：您使用的是“%@”。

# ShellIntegrationInstaller.Done
source: Done! Select “Continue” to proceed.
de: Fertig! Wählen Sie „Fortfahren“, um fortzufahren.
ja: 完了しました！「続ける」を選択して進んでください。
pt_br: Concluído! Selecione “Continuar” para prosseguir.
ru: Готово! Нажмите «Продолжить», чтобы перейти дальше.
zh_hans: 完成！选择“继续”以继续。

# ShellIntegrationInstaller.Installed
source: ✅ Installed iTerm2 utility scripts.
de: ✅ iTerm2-Hilfsskripte installiert.
ja: ✅ iTerm2のユーティリティスクリプトをインストールしました。
pt_br: ✅ Scripts utilitários do iTerm2 instalados.
ru: ✅ Служебные скрипты iTerm2 установлены.

# ShellIntegrationInstaller.LearnMore
source: Learn more.
de: Weitere Informationen.
ja: 詳細を見る。
pt_br: Saiba mais.
ru: Подробнее.
zh_hans: 了解更多内容。

# ShellIntegrationInstaller.PressContinueToRun
source: Press “Continue” to run this command:
de: Klicken Sie auf „Fortfahren“, um diesen Befehl auszuführen:
ja: 「続ける」を押してこのコマンドを実行します:
pt_br: Pressione “Continuar” para executar este comando:
ru: Нажмите «Продолжить», чтобы выполнить эту команду:
zh_hans: 点击“继续”以执行此命令：

# ShellIntegrationInstaller.PreviewCommand
source: Preview Command
de: Befehlsvorschau
ja: コマンドをプレビュー
pt_br: Pré-visualizar comando
ru: Предпросмотр команды
zh_hans: 预览命令

# ShellIntegrationInstaller.SendAgain
source: Send Again
de: Erneut senden
ja: 再送信
pt_br: Enviar novamente
ru: Отправить снова
zh_hans: 重新发送

# ShellIntegrationInstaller.ShellNotSupported
source: 🛑 Your shell is not supported. Only bash, fish, tcsh, xonsh, and zsh work with shell integration
de: 🛑 Ihre Shell wird nicht unterstützt. Nur bash, fish, tcsh, xonsh und zsh funktionieren mit der Shell-Integration
ja: 🛑 お使いのシェルはサポートされていません。 Shell Integrationはbash、fish、tcsh、xonsh、zshでのみ動作します
pt_br: 🛑 Seu shell não é compatível. Apenas bash, fish, tcsh, xonsh e zsh funcionam com o Shell Integration
ru: 🛑 Ваша оболочка не поддерживается. Интеграция с оболочкой работает только с bash, fish, tcsh, xonsh и zsh
zh_hans: 🛑 不支持你的 Shell。 只有 bash、fish、tcsh、xonsh 和 zsh 可与 Shell 集成配合使用

# ShellIntegrationInstaller.ShellUnsupported
source: 😞 Your shell is not supported, or perhaps your $SHELL environment variable is not set correctly. Press “Continue” to try again.
de: 😞 Ihre Shell wird nicht unterstützt, oder eventuell ist Ihre Umgebungsvariable $SHELL nicht korrekt gesetzt. Klicken Sie auf „Fortfahren“, um es erneut zu versuchen.
ja: 😞 お使いのシェルはサポートされていないか、$SHELL環境変数が正しく設定されていない可能性があります。「続ける」を押してもう一度お試しください。
pt_br: 😞 Seu shell não é compatível, ou talvez a variável de ambiente $SHELL não esteja configurada corretamente. Pressione “Continuar” para tentar novamente.
ru: 😞 Ваша оболочка не поддерживается, либо переменная окружения $SHELL задана неверно. Нажмите «Продолжить», чтобы повторить попытку.
zh_hans: 😞 你的 Shell 不受支持，或者 $SHELL 环境变量可能未正确设置。按“继续”重试。

# ShellIntegrationInstaller.Step1Discover
source: 1. Discover.
de: 1. Ermitteln.
ja: 1. 検出。
pt_br: 1. Descobrir.
ru: 1. Определить оболочку.

# ShellIntegrationInstaller.Step2Write
source: Step 2. Write the shell integration script.
de: Schritt 2. Shell-Integrationsskript schreiben.
ja: ステップ2. Shell Integrationスクリプトを書き込みます。
pt_br: Etapa 2. Gravar o script de integração com o shell.
ru: Шаг 2. Записать скрипт интеграции с оболочкой.

# ShellIntegrationInstaller.Step3Install
source: Step 3. Install iTerm2 utility scripts.
de: Schritt 3. iTerm2-Hilfsskripte installieren.
ja: ステップ3. iTerm2のユーティリティスクリプトをインストールします。
pt_br: Etapa 3. Instalar os scripts utilitários do iTerm2.
ru: Шаг 3. Установить служебные скрипты iTerm2.

# ShellIntegrationInstaller.StepUpdateFormat
source: Step %d. Update your shell’s dotfile.
de: Schritt %d. Dotfile Ihrer Shell aktualisieren.
ja: ステップ%d. シェルのdotfileを更新します。
pt_br: Etapa %d. Atualizar o dotfile do seu shell.
ru: Шаг %d. Обновить файл настроек вашей оболочки.

# ShellIntegrationInstaller.Updated
source: ✅ Updated your shell’s dotfile.
de: ✅ Dotfile Ihrer Shell aktualisiert.
ja: ✅ シェルのdotfileを更新しました。
pt_br: ✅ Dotfile do seu shell atualizado.
ru: ✅ Файл настроек оболочки обновлён.

# ShellIntegrationInstaller.WaitingForCommand
source: Waiting for this command to finish:
de: Warten auf den Abschluss dieses Befehls:
ja: このコマンドの終了を待っています:
pt_br: Aguardando a conclusão deste comando:
ru: Ожидание завершения этой команды:
zh_hans: 正在等待该命令完成：

# ShellIntegrationInstaller.WaitingText
source: ⏳ Waiting for command to complete…
de: ⏳ Warten auf den Abschluss des Befehls…
ja: ⏳ コマンドの完了を待っています…
pt_br: ⏳ Aguardando a conclusão do comando…
ru: ⏳ Ожидание завершения команды…
zh_hans: ⏳ 正在等待命令完成…

# ShellIntegrationInstaller.Wrote
source: ✅ Wrote the shell integration script.
de: ✅ Shell-Integrationsskript geschrieben.
ja: ✅ Shell Integrationスクリプトを書き込みました。
pt_br: ✅ Script de integração com o shell gravado.
ru: ✅ Скрипт интеграции с оболочкой записан.

# ShellIntegrationInstaller.XonshDone
source: ✅ Xonsh auto-loads scripts from rc.d (no dotfile update needed).
de: ✅ Xonsh lädt Skripte automatisch aus rc.d (keine Dotfile-Aktualisierung erforderlich).
ja: ✅ Xonshはrc.dからスクリプトを自動読み込みします（dotfileの更新は不要です）。
pt_br: ✅ O Xonsh carrega scripts automaticamente do rc.d (não é necessário atualizar o dotfile).
ru: ✅ Xonsh автоматически загружает скрипты из rc.d (обновление файла настроек не требуется).
zh_hans: ✅ Xonsh 从 rc.d 自动载入脚本（无需更新 dotfile）。

# ShellIntegrationInstaller.XonshStepFormat
source: Step %d. Xonsh auto-loads scripts from rc.d (no dotfile update needed).
de: Schritt %d. Xonsh lädt Skripte automatisch aus rc.d (keine Dotfile-Aktualisierung erforderlich).
ja: ステップ%d. Xonshはrc.dからスクリプトを自動読み込みします（dotfileの更新は不要です）。
pt_br: Etapa %d. O Xonsh carrega scripts automaticamente do rc.d (não é necessário atualizar o dotfile).
ru: Шаг %d. Xonsh автоматически загружает скрипты из rc.d (обновление файла настроек не требуется).
zh_hans: 步骤 %d. Xonsh 从 rc.d 自动载入脚本（无需更新 dotfile）。

# ShortcutInput.AccidentalConfirmHotkey
source: Are you sure you want to use “%@” as a hotkey? This looks like a commonly used keystroke.
de: Sind Sie sicher, dass Sie „%@“ als Hotkey verwenden möchten? Dies sieht nach einem häufig verwendeten Tastendruck aus.
ja: 「%@」をホットキーとして使用してもよろしいですか? これはよく使われるキー操作のようです。
pt_br: Tem certeza de que deseja usar “%@” como atalho? Isto parece uma combinação de teclas de uso comum.
ru: Вы уверены, что хотите использовать «%@» в качестве горячей клавиши? Это похоже на часто используемое сочетание клавиш.
zh_hans: 您确定要将“%@”设为热键吗？这看起来是一个常用的按键。

# ShortcutInput.AccidentalConfirmLeader
source: Are you sure you want to use “%@” as the leader? This looks like a commonly used keystroke.
de: Sind Sie sicher, dass Sie „%@“ als Leader verwenden möchten? Dies sieht nach einem häufig verwendeten Tastendruck aus.
ja: 「%@」をリーダーとして使用してもよろしいですか? これはよく使われるキー操作のようです。
pt_br: Tem certeza de que deseja usar “%@” como líder? Isto parece uma combinação de teclas de uso comum.
ru: Вы уверены, что хотите использовать «%@» в качестве ведущей клавиши? Это похоже на часто используемое сочетание клавиш.
zh_hans: 您确定要将“%@”作为领导键吗？这看起来是一个常用的按键。

# ShortcutInput.AccidentalConfirmOpenQuickly
source: Are you sure you want to use “%@” as the Open Quickly hotkey? This looks like a commonly used keystroke.
de: Sind Sie sicher, dass Sie „%@“ als Hotkey für Schnell öffnen verwenden möchten? Dies sieht nach einem häufig verwendeten Tastendruck aus.
ja: 「%@」をOpen Quicklyのホットキーとして使用してもよろしいですか? これはよく使われるキー操作のようです。
pt_br: Tem certeza de que deseja usar “%@” como atalho do Abrir Rapidamente? Isto parece uma combinação de teclas de uso comum.
ru: Вы уверены, что хотите использовать «%@» в качестве горячей клавиши Open Quickly? Это похоже на часто используемое сочетание клавиш.
zh_hans: 确定要将“%@”设为Open Quickly快捷键吗？这似乎是一个常用的按键。

# ShortcutInput.ClickToSet
source: Click to Set
de: Zum Festlegen klicken
ja: クリックして設定
pt_br: Clique para definir
ru: Нажмите, чтобы задать
zh_hans: 点按以设置

# ShortcutInput.ConfirmHeading
source: Confirm Shortcut
de: Tastenkombination bestätigen
ja: ショートカットの確認
pt_br: Confirmar atalho
ru: Подтвердите сочетание клавиш
zh_hans: 确认快捷键

# ShortcutInput.Recording
source: Recording
de: Wird aufgezeichnet
ja: 記録中
pt_br: Gravando
ru: Запись
zh_hans: 正在录制

# SmartSelection.ActionCountSuffix
source: , %ld actions
de: , %ld Aktionen
ja: 、アクション%ld個
pt_br: , %ld ações
ru: , %ld действия
zh_hans: ，%ld 个操作

# SmartSelection.Actions
source: Actions…
de: Aktionen…
ja: アクション…
pt_br: Ações…
ru: Действия…
zh_hans: 操作…

# SmartSelection.ActionsWithCount
source: Actions (%@)…
de: Aktionen (%@)…
ja: アクション (%@)…
pt_br: Ações (%@)…
ru: Действия (%@)…
zh_hans: 操作（%@）…

# SmartSelection.ClickToTest
source: Click on text in playground to test rules
de: Klicken Sie auf Text im Testbereich, um Regeln zu testen
ja: プレイグラウンドのテキストをクリックしてルールをテスト
pt_br: Clique no texto da área de teste para testar as regras
ru: Щёлкните текст в песочнице, чтобы проверить правила
zh_hans: 在演练场中点按文本以测试规则

# SmartSelection.CloseVisualization
source: Close Regular Expression Visualization
de: Visualisierung des regulären Ausdrucks schließen
ja: 正規表現の可視化を閉じる
pt_br: Fechar visualização de expressão regular
ru: Закрыть визуализацию регулярного выражения
zh_hans: 关闭正则表达式可视化工具

# SmartSelection.MultipleRulesSelected
source: Multiple rules selected
de: Mehrere Regeln ausgewählt
ja: 複数のルールが選択されています
pt_br: Várias regras selecionadas
ru: Выбрано несколько правил
zh_hans: 选择了多条规则

# SmartSelection.NoMatch
source: No match
de: Keine Übereinstimmung
ja: 一致なし
pt_br: Nenhuma correspondência
ru: Нет совпадений
zh_hans: 无匹配

# SmartSelection.NoRuleSelected
source: No rule selected
de: Keine Regel ausgewählt
ja: ルールが選択されていません
pt_br: Nenhuma regra selecionada
ru: Правило не выбрано
zh_hans: 未选择任何规则

# SmartSelection.OpenVisualization
source: Open Regular Expression Visualization
de: Visualisierung des regulären Ausdrucks öffnen
ja: 正規表現の可視化を開く
pt_br: Abrir visualização de expressão regular
ru: Открыть визуализацию регулярного выражения
zh_hans: 打开正则表达式可视化工具

# SmartSelection.PlaygroundPlaceholder
source: Smart Selection Playground Enter text here, then click to see which rule matches at that location.
de: Testbereich für Intelligente Auswahl Geben Sie hier Text ein und klicken Sie dann, um zu sehen, welche Regel an dieser Stelle übereinstimmt.
ja: Smart Selectionプレイグラウンド ここにテキストを入力し、クリックするとその位置に一致するルールが表示されます。
pt_br: Área de teste da seleção inteligente Digite o texto aqui e clique para ver qual regra corresponde naquele local.
ru: Песочница Smart Selection Введите здесь текст, затем щёлкните, чтобы увидеть, какое правило соответствует этому месту.
zh_hans: 智能选择演练场 在此输入文本，然后点按查看该位置匹配的规则。

# SmartSelection.PrecisionHigh
source: High
de: Hoch
ja: 高
pt_br: Alta
ru: Высокая
zh_hans: 高

# SmartSelection.PrecisionHighPhrase
source: High precision
de: Hohe Genauigkeit
ja: 高精度
pt_br: Precisão alta
ru: Высокая точность
zh_hans: 高精度

# SmartSelection.PrecisionLow
source: Low
de: Niedrig
ja: 低
pt_br: Baixa
ru: Низкая
zh_hans: 低

# SmartSelection.PrecisionLowPhrase
source: Low precision
de: Niedrige Genauigkeit
ja: 低精度
pt_br: Precisão baixa
ru: Низкая точность
zh_hans: 低精度

# SmartSelection.PrecisionNormalPhrase
source: Normal precision
de: Normale Genauigkeit
ja: 標準精度
pt_br: Precisão normal
ru: Обычная точность
zh_hans: 普通精度

# SmartSelection.PrecisionUndefined
source: Undefined
de: Undefiniert
ja: 未定義
pt_br: Indefinida
ru: Не определена
zh_hans: 未定义精度

# SmartSelection.PrecisionUndefinedPhrase
source: Undefined precision
de: Undefinierte Genauigkeit
ja: 未定義の精度
pt_br: Precisão indefinida
ru: Неопределённая точность
zh_hans: 未定义精度

# SmartSelection.PrecisionVeryHigh
source: Very High
de: Sehr hoch
ja: 非常に高い
pt_br: Muito alta
ru: Очень высокая
zh_hans: 极高

# SmartSelection.PrecisionVeryHighPhrase
source: Very high precision
de: Sehr hohe Genauigkeit
ja: 非常に高い精度
pt_br: Precisão muito alta
ru: Очень высокая точность
zh_hans: 极高精度

# SmartSelection.PrecisionVeryLow
source: Very Low
de: Sehr niedrig
ja: 非常に低い
pt_br: Muito baixa
ru: Очень низкая
zh_hans: 极低

# SmartSelection.PrecisionVeryLowPhrase
source: Very low precision
de: Sehr niedrige Genauigkeit
ja: 非常に低い精度
pt_br: Precisão muito baixa
ru: Очень низкая точность
zh_hans: 低精度

# SmartSelection.Rule.EmailAddress
source: email address
de: E-Mail-Adresse
ja: メールアドレス
pt_br: endereço de email
ru: адрес электронной почты
zh_hans: 电子邮件地址

# SmartSelection.Rule.JavaPythonIncludePaths
source: Java/Python include paths
de: Java/Python-Include-Pfade
ja: Java/Pythonのインクルードパス
pt_br: Caminhos de inclusão Java/Python
ru: Пути импорта Java/Python
zh_hans: Java/Python 包含路径

# SmartSelection.Rule.ObjCSelector
source: Obj-C selector
de: Obj-C-Selektor
ja: Obj-Cセレクタ
pt_br: Seletor Obj-C
ru: Селектор Obj-C
zh_hans: Obj-C 选择器

# SmartSelection.Rule.Paths
source: Paths
de: Pfade
ja: パス
pt_br: Caminhos
ru: Пути
zh_hans: 路径

# SmartSelection.Rule.QuotedString
source: Quoted string
de: Zeichenkette in Anführungszeichen
ja: 引用符付き文字列
pt_br: String entre aspas
ru: Строка в кавычках
zh_hans: 带引号的字符串

# SmartSelection.Rule.WordBoundedByWhitespace
source: Word bounded by whitespace
de: Von Leerraum begrenztes Wort
ja: 空白で区切られた単語
pt_br: Palavra delimitada por espaços
ru: Слово, ограниченное пробельными символами
zh_hans: 由空白字符包围的文本

# Snippets.SaveFailedBody
source: There was a problem saving snippets to “%1$@”. The error was: %2$@
de: Beim Speichern der Schnipsel in „%1$@“ ist ein Problem aufgetreten. Der Fehler war: %2$@
ja: スニペットを「%1$@」に保存する際に問題が発生しました。 エラー内容: %2$@
pt_br: Ocorreu um problema ao salvar os fragmentos em “%1$@”. O erro foi: %2$@
ru: Не удалось сохранить фрагменты в «%1$@». Ошибка: %2$@
zh_hans: 在将片段保存到“%1$@”时出现问题。 错误内容： %2$@

# Snippets.SaveFailedHeading
source: Problem Saving Snippets
de: Problem beim Speichern der Schnipsel
ja: スニペットの保存に関する問題
pt_br: Problema ao salvar os fragmentos
ru: Проблема при сохранении фрагментов
zh_hans: 存储代码片段时出现问题

# Snippets.SearchHelp
source: Terms in the search query are used to prefix search snippet titles, content, and tags. You can use the following operators to restrict what attributes of snippets a term searches: * `tag:` to search only tags. * `title:` to search only snippet titles. * `text:` to search only the text of a snippet. For example, `tag:linux`. To search only for snippets that do *not* match a term, use the `-` operator. For example, `-linux` or `-tag:linux`. You can use `|` as logical OR. For example, `linux|bsd` or `tag:linux|tag:bsd`.
de: Suchbegriffe werden verwendet, um Schnipseltitel, -inhalte und -tags präfixbasiert zu durchsuchen. Sie können die folgenden Operatoren verwenden, um einzuschränken, welche Attribute von Schnipseln ein Begriff durchsucht: * `tag:` durchsucht nur Tags. * `title:` durchsucht nur Schnipseltitel. * `text:` durchsucht nur den Text eines Schnipsels. Beispiel: `tag:linux`. Um nur nach Schnipseln zu suchen, die einem Begriff *nicht* entsprechen, verwenden Sie den Operator `-`. Beispiel: `-linux` oder `-tag:linux`. Sie können `|` als logisches ODER verwenden. Beispiel: `linux|bsd` oder `tag:linux|tag:bsd`.
ja: 検索クエリの語句は、スニペットのタイトル、内容、タグを検索するために使用されます。 以下の演算子を使うと、語句が検索するスニペットの属性を制限できます: * `tag:` タグのみを検索します。 * `title:` スニペットのタイトルのみを検索します。 * `text:` スニペットのテキストのみを検索します。 例: `tag:linux`。 語句に一致*しない*スニペットだけを検索するには、`-` 演算子を使います。例: `-linux` や `-tag:linux`。 論理和(OR)として `|` を使えます。例: `linux|bsd` や `tag:linux|tag:bsd`。
pt_br: Os termos na consulta de busca são usados para buscar por prefixo os títulos, o conteúdo e as tags dos fragmentos. Você pode usar os seguintes operadores para restringir quais atributos dos fragmentos um termo busca: * `tag:` para buscar apenas nas tags. * `title:` para buscar apenas nos títulos dos fragmentos. * `text:` para buscar apenas no texto de um fragmento. Por exemplo, `tag:linux`. Para buscar apenas fragmentos que *não* correspondem a um termo, use o operador `-`. Por exemplo, `-linux` ou `-tag:linux`. Você pode usar `|` como OU lógico. Por exemplo, `linux|bsd` ou `tag:linux|tag:bsd`.
ru: Термины в поисковом запросе используются для поиска по заголовкам, содержимому и тегам фрагментов. Вы можете использовать следующие операторы, чтобы ограничить, по каким атрибутам фрагментов выполняется поиск термина: * `tag:` для поиска только по тегам. * `title:` для поиска только по заголовкам фрагментов. * `text:` для поиска только по тексту фрагмента. Например, `tag:linux`. Чтобы искать фрагменты, которые *не* соответствуют термину, используйте оператор `-`. Например, `-linux` или `-tag:linux`. Вы можете использовать `|` как логическое ИЛИ. Например, `linux|bsd` или `tag:linux|tag:bsd`.
zh_hans: 搜索查询中的术语用于作为搜索片段标题、内容和标签的前缀。 您可以使用以下运算符来限制术语对片段的某些属性进行搜索： * `tag:` 仅搜索标签。 * `title:` 仅搜索片段标题。 * `text:` 仅搜索片段文本。 例如，使用 `tag:linux`。 若要仅搜索与术语不匹配的片段，请使用 `-` 运算符。例如，使用 `-linux` 或 `-tag:linux`。 您可以将 `|` 用作逻辑或。例如，使用 `linux|bsd` 或 `tag:linux|tag:bsd`。

# SnippetsEditing.AddAbove
source: Add Above
de: Oberhalb hinzufügen
ja: 上に追加
pt_br: Adicionar acima
ru: Добавить выше
zh_hans: 在上方添加

# SnippetsEditing.AddBelow
source: Add Below
de: Unterhalb hinzufügen
ja: 下に追加
pt_br: Adicionar abaixo
ru: Добавить ниже
zh_hans: 在下方添加

# SnippetsEditing.Duplicate
source: Duplicate
de: Duplizieren
ja: 複製
pt_br: Duplicar
ru: Дублировать
zh_hans: 复制

# SnippetsEditing.ExportFailedHeading
source: Export Failed
de: Export fehlgeschlagen
ja: エクスポートに失敗しました
pt_br: Falha na exportação
ru: Не удалось экспортировать
zh_hans: 导出失败

# SnippetsEditing.ImportFailedHeading
source: Import Failed
de: Import fehlgeschlagen
ja: インポートに失敗しました
pt_br: Falha na importação
ru: Не удалось импортировать
zh_hans: 导入失败

# SnippetsEditing.LoadError
source: While loading %1$@: %2$@
de: Beim Laden von %1$@: %2$@
ja: %1$@ の読み込み中: %2$@
pt_br: Ao carregar %1$@: %2$@
ru: При загрузке %1$@: %2$@
zh_hans: 正在加载 %1$@: %2$@

# SnippetsEditing.MalformedFile
source: Malformed file at %@
de: Fehlerhafte Datei bei %@
ja: %@ のファイルが不正な形式です
pt_br: Arquivo malformado em %@
ru: Некорректный файл: %@
zh_hans: 文件格式错误：%@

# SnippetsEditing.ParseError
source: While parsing %1$@: %2$@
de: Beim Parsen von %1$@: %2$@
ja: %1$@ の解析中: %2$@
pt_br: Ao analisar %1$@: %2$@
ru: При разборе %1$@: %2$@
zh_hans: 正在解析 %1$@: %2$@

# SnippetsEditing.SaveError
source: Error saving to %1$@: %2$@
de: Fehler beim Speichern in %1$@: %2$@
ja: %1$@ への保存エラー: %2$@
pt_br: Erro ao salvar em %1$@: %2$@
ru: Ошибка сохранения в %1$@: %2$@
zh_hans: 保存至 %1$@ 时出错: %2$@

# SnippetsEditing.Snippets
source: Snippets
de: Schnipsel
ja: スニペット
pt_br: Fragmentos
ru: Фрагменты
zh_hans: 代码片段

# SnippetsMenu.PressOptionToEdit
source: Press Option to Edit Before Sending
de: Option drücken, um vor dem Senden zu bearbeiten
ja: 送信前に編集するには Option キーを押してください
pt_br: Pressione Option para editar antes de enviar
ru: Нажмите Option, чтобы изменить перед отправкой
zh_hans: 按住 Option 可在发送前编辑

# SpecialExceptions.ConfirmHeading
source: Confirm
de: Bestätigen
ja: 確認
pt_br: Confirmar
ru: Подтверждение
zh_hans: 确认

# SpecialExceptions.ImportErrorHeading
source: Problem Importing Special Exceptions
de: Problem beim Importieren spezieller Ausnahmen
ja: 特別な例外のインポートに関する問題
pt_br: Problema ao importar exceções especiais
ru: Проблема при импорте специальных исключений
zh_hans: 导入特殊例外时出现问题

# SpecialExceptions.ImportMalformed
source: This file is not well formed. Is it from a newer version of iTerm2?
de: Diese Datei ist nicht wohlgeformt. Stammt sie aus einer neueren Version von iTerm2?
ja: このファイルの形式が正しくありません。新しいバージョンの iTerm2 のものではありませんか?
pt_br: Este arquivo não está bem formado. Ele é de uma versão mais recente do iTerm2?
ru: Этот файл имеет неверный формат. Возможно, он создан в более новой версии iTerm2?
zh_hans: 此文件格式不正确。它是否来自更新版本的 iTerm2？

# SpecialExceptions.ImportMissingFonts
source: You must install the following fonts to use the exceptions in this file: %@
de: Sie müssen die folgenden Schriftarten installieren, um die Ausnahmen in dieser Datei zu verwenden: %@
ja: このファイルの例外を使用するには、次のフォントをインストールする必要があります: %@
pt_br: Você precisa instalar as seguintes fontes para usar as exceções neste arquivo: %@
ru: Чтобы использовать исключения из этого файла, необходимо установить следующие шрифты: %@
zh_hans: 要使用此文件中的例外，你必须安装以下字体： %@
